CSI API ETABS v1
cLineElm.GetTransformationMatrix Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTransformationMatrix(
	string Name,
	ref double[] Value
)
Function GetTransformationMatrix (
	Name As String,
	ByRef Value As Double()
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim Value As Double()
Dim returnValue As Integer
returnValue = instance.GetTransformationMatrix(Name,
	Value)
int GetTransformationMatrix(
	String^ Name,
	array<double>^% Value
)
abstract GetTransformationMatrix :
        Name : string *
        Value : float[] byref -> int
Parameters
Name
Type: System.String
Value
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace